///////////////////////获取经典线路数据
function getLines() {
  return [{
    id: 1,
    name: "2日行程",
    navname: "丽江+玉龙雪山经典2日游",
    lineimg: "/assets/xc2.jpg",
    selected: "itemselect",
    items: [{  //第一天
      id: 1,
      title: "DAY1 丽江",
      subtitle: [{
        typename: "article",
        text: "今天来一场悠闲的丽江古城漫步游，感受最柔软舒适的古城时光吧。不大的丽江古城中，包含着纳西族皇宫木府、开满小吃铺子的四方街、灯火酒绿的艳遇酒吧等各种元素。"
      }],
      scheme: [{
        id: 1,  //景点编号
        keywords: "大水车",
        longitude: 100.233220,
        latitude: 26.876170,
        address: "云南省丽江市古城区东大街1号丽江古城内",
        distance: "0.4公里",
        iconurl: "../../assets/scenery.png",
        text: "和大水车合影留念",
        subtext: "丽江.建议玩半小时",
        texts: [
          "/assets/s1.jpg",
          "走进丽江古城北门，一大一小两架水车便映入眼帘。这两驾连轴大水车是古城的标志性建筑，也是古城内最人声鼎沸的地方，一年四季都挤满了留影和集合的游客，想要单独和水车合影一张必须眼尖手快。",
          "大水车前的石桥上，是拍摄水车的最佳地点。若是春天的傍晚前来，夕阳穿过水车，照射在一旁刻有江泽民题词的照壁上，碧绿的垂柳被微风拂动，潺潺的流水反射着碎金般的阳光，是大水车最美的一面。"
        ]
      }, {
        id: 2,
        keywords: "四方街",
        longitude: 100.233950,
        latitude: 26.872040,
        address: "云南省丽江市古城区古城中心",
        distance: "0.2公里",
        iconurl: "../../assets/scenery.png",
        text: "逛四方街品尝纳西美食",
        subtext: "丽江.距上一站0.4公里.建议玩半小时",
        texts: [
          "/assets/s2.jpg",
          "丽江虽然不以美食而著称，但是却有很多有纳西族代表性的特色小吃，这其中以鸡豆凉粉、纳西烤鱼、丽江粑粑等最受欢迎。走在丽江古城的四方街上，短短的街道上有数十家小吃店，让你一次吃遍各种纳西小吃。",
          "除了小吃外，丽江特色火锅也非常出名，以腊排骨火锅、洋芋鸡火锅、黑山羊火锅、菌类火锅等最美味。丽江的火锅有招牌蘸水，最好可以放一些薄荷涮在肉锅里，肉会带有清新的香味，薄荷混了肉味，非常好吃。",
          "若要想吃正宗纳西菜，比较具有代表性的有三叠水和八大碗。“三叠水”是纳西人的最高礼仪，按所上菜看的口味分三次上席；“八大碗”则是纳西族传统的年夜饭，以八种各有寓意的菜式致以美好祝福。"
        ]
      }, {
        id: 3,
        keywords: "狮子山",
        longitude: 100.232550,
        latitude: 26.870880,
        address: "云南省丽江市古城区狮子山公园内",
        distance: "0.3公里",
        iconurl: "../../assets/scenery.png",
        text: "登狮子山俯瞰丽江古城全景",
        subtext: "丽江.距上一站0.2公里.建议玩半小时",
        texts: [
          "/assets/s3.jpg",
          "丽江古城西侧的狮子山顶，是观赏丽江古城全景的最佳去处，可北望玉龙雪山，东俯丽江古城，西瞰丽江新城，南眺田园风光。晚上在狮子山俯瞰丽江，月色下在万家灯火装点下的古城更是流光溢彩，璀璨动人。",
          "狮子山因山体宛如一头睡卧的狮子而得名，山顶坐落着极富建筑特色的万古楼，是丽江城内的制高点。公园南端有始建于乾隆十九年的白马龙潭寺，寺东有一泓清澈见底的潭水，被纳西人民奉为神泉。"
        ]
      }, {
        id: 4,
        keywords: "木府",
        longitude: 100.234600,
        latitude: 26.869080,
        address: "云南省丽江市古城区大研镇光义街",
        distance: "0.3公里",
        iconurl: "../../assets/scenery.png",
        text: "木府：精致雄伟的丽江王府",
        subtext: "丽江.距上一站0.3公里.建议玩1小时",
        texts: [
          "/assets/s4.jpg",
          "丽江古城内的木府，是历代丽江木氏土司的王府。土司府在保持了中原建筑风格的基础上，添加了白族和纳西族的工艺，建筑精美而宏大，蔚为壮观，难怪徐霞客当年在木府门外慨叹：“宫室之丽，拟于王者”。",
          "木府虽是土司王府，但宫室之瑰丽，不逊皇家，据说当年既是“仿紫禁城而建”，鼎盛时期，有宫舍100多间。府内中轴线上建有忠义牌坊、木牌坊、议事厅、万卷楼等建筑，高低错落，气势磅礴。",
          "木府历经几百年的辉煌，大部分毁于清末的战火中，目前所见的绝大多数是1999年重建而成。虽是重建，但不妨碍其成为丽江古城内的代表性建筑。电视连续剧《木府风云》、《钱王》都是在这里拍摄的。"
        ]
      }, {
        id: 5,
        keywords: "四方街",
        longitude: 100.233950,
        latitude: 26.872040,
        address: "云南省丽江市古城区古城中心",
        distance: "0.6公里",
        iconurl: "../../assets/scenery.png",
        text: "跳一次纳西广场舞",
        subtext: "丽江.距上一站0.3公里.建议玩半小时",
        texts: [
          "/assets/s5.jpg",
          "每逢节庆日，丽江的纳西族的小伙子都要面对玉龙雪山，敲着“东巴鼓”，跳起欢快的东巴舞。如今在四方街上，几乎每天都有穿着民族服饰欢快起舞的纳西族，和他们一起跳一次广场舞，绝对会是难得的体验。",
          "东巴舞是纳西族东巴文化的重要组成部分，一般运用于宗教祭祀活动中。东巴舞来源于古代纳西的社会生活，不少动作都是模拟各种动物的动作来进行的，形象十分生动。"
        ]
      }, {
        id: 6,
        keywords: "江湖酒吧",
        longitude: 100.239620,
        latitude: 26.870820,
        address: "云南省丽江市古城区五一街王家庄巷41",
        iconurl: "../../assets/scenery.png",
        text: "泡一泡丽江酒吧",
        subtext: "丽江.距上一站0.6公里",
        texts: [
          "/assets/s6.jpg",
          "如果说白天的丽江古城是民俗与美景的结合，那么夜幕降临后的丽江则不负其“艳遇之都”的美誉。古城内大大小小的酒吧纷纷开张，在鲜艳的霓虹灯下，素不相识的人们聚在一起，饮酒作乐。",
          "丽江城内酒吧众多，最具特色的当属火塘酒吧了。火塘是藏区家中生火取暖、聚会的地方，一年365天都不会熄灭。在火塘酒吧中，歌手和客人围坐在火塘周边，自弹自唱、谈天说地、其乐融融。",
          "江湖酒吧是丽江最热门的火塘音乐酒吧，也是音乐爱好者们在丽江的聚集点之一。江湖酒吧的主唱小松声音穿透力很强，伴随着让人回味无穷的音乐声，不大的酒吧中男男女女围着一个大火塘谈笑风生，十分惬意。"
        ]
      }]
    }, {  //第二天
      id: 2,
      title: "DAY2 丽江",
      subtitle: [{
        typename: "article",
        text: "丽江城北的玉龙雪山是纳西族心中的神山，可以从丽江乘班车前往。这里景观丰富，你可以上山欣赏高海拔冰川的瑰丽景象，也可以在山腰欣赏蓝月谷的碧水、云杉坪的参天古木。除了自然景观外，蓝月谷每天中午都会上演的《印象丽江》舞台剧也不可错过。"
      }],
      scheme: [{
        id: 7,
        keywords: "玉龙冰川公园",
        longitude: 100.254410,
        latitude: 27.099090,
        address: "云南省丽江市玉龙纳西族自治县玉龙雪山景区内",
        distance: "8.1公里",
        iconurl: "../../assets/scenery.png",
        text: "登玉龙雪山近距离观赏冰川",
        subtext: "丽江.距上一站26公里.建议玩2-3小时",
        texts: [
          "/assets/s7.jpg",
          "位于丽江古城旁的玉龙雪山，是北半球纬度最低的雪山，山上发育着19条冰川，远望如同一片瀑布悬挂于山顶，在阳光的照耀下泛着银光。乘坐大索道前往山腰，沿着山间栈道就可以近距离观赏冰川。",
          "玉龙雪山上的冰川公园是玉龙雪山的主峰扇子陡东北坡一片平缓坡地，白色的山体即磅礴壮观又洁白清秀。这里秋冬春三季白雪茫茫，但到了夏季时，形成于四万多年前的白水一号冰川则裸露在外，游客可以近距离观察。"
        ]
      }, {
        id: 8,
        keywords: "印象丽江",
        longitude: 100.258430,
        latitude: 27.097400,
        address: "云南省丽江市玉龙纳西族自治县雪山国家风景名胜区内",
        distance: "3.4公里",
        iconurl: "../../assets/scenery.png",
        text: "看一场《印象丽江》",
        subtext: "丽江.距上一站8.1公里.建议玩2小时",
        texts: [
          "/assets/s8.jpg",
          "《印象丽江》是张艺谋导演的大型实景舞台剧，将云南少数民族的生活、耕种、爱情、狩猎、欢庆、行商等各种元素，用艺术的形式展现在人们的眼前，全视角的呈现了东巴文化的风貌。",
          "《印象丽江》的演员大部分都是当地居民，演出在海拔3100米的玉龙雪山甘海子蓝月谷剧场露天舞台举行，用最淳朴的演员与最真实的场景，展示出丽江原住民对天地、山川的感情。",
          "整个表演一气呵成，搭配蓝天白云雪山的真实背景，让人仿佛置身于其中。在震撼的背景音乐里，你能触及到纳西族人生命里的顽强与不息；回荡在雪山上的情歌，让你感受纳西族青年男女那纯净的爱情。"
        ]
      }, {
        id: 9,
        keywords: "蓝月谷",
        longitude: 100.244680,
        latitude: 27.125830,
        address: "云南省丽江市玉龙纳西族自治县玉龙雪山景区内",
        distance: "0.1公里",
        iconurl: "../../assets/scenery.png",
        text: "蓝月谷：水色碧蓝小九寨",
        subtext: "丽江.距上一站3.4公里.建议玩1-2小时",
        texts: [
          "/assets/s9.jpg",
          "蓝月谷原名“白水河”，每逢晴天，月牙形山谷中的湖水都会呈现出蔚蓝的颜色，因而得名。 蓝月谷被称为“小九寨”，这里的湖光山色虽然比不上九寨沟的绝美和静谧，但在雪山的映衬下也别有一番韵味。",
          "蓝月谷位于玉龙雪山脚下，湖水都是由雪山融水汇聚而成，清澈见底。水中富含钙、铜等金属离子，因此形成了钙华地貌，以及蔚蓝色的池水。谷中的河水受山体阻挡，形成了玉液湖、镜潭湖、蓝月湖等湖泊。"
        ]
      }, {
        id: 10,
        keywords: "云杉坪",
        longitude: 100.234920,
        latitude: 27.129710,
        address: "云南省丽江市玉龙纳西族自治县玉龙雪山",
        iconurl: "../../assets/scenery.png",
        text: "云杉坪：玉龙雪山最佳拍摄地",
        subtext: "丽江.距上一站0.1公里.建议玩2-3小时",
        texts: [
          "/assets/s10.jpg",
          "云杉坪是玉龙雪山山腰上的一片高山草甸，草场周边被高大茂密的云杉林所环抱。在这个海拔3200米的草甸上，可以将玉龙十三峰的壮观景象一览无余，是拍摄雪山的最佳取景点。",
          "云杉坪又名“殉情谷”，传说是以前有很多青年男女在此殉情，因而成为了纳西青年男女心中的爱情圣地。前往云杉坪需要在玉龙雪山景区内乘坐云杉坪索道，穿过茂密繁盛的云杉林之后，便可来到草场。"
        ]
      }]
    }]
  }, {
    id: 2,
    name: "4日行程",
    navname: "丽江与周边经典4日游",
    lineimg: "/assets/xc4.jpg",
    selected: "",
    items: [{  //第一天
      id: 1,
      title: "DAY1 丽江",
      subtitle: [{
        typename: "article",
        text: "丽江+束河+玉龙雪山+拉市海的4日行程，可以漫步古城中悠闲度假，也能走遍雪山湖泊欣赏丽江坝子的绝美风光。丽江及周边交通发达，包车或乘坐公交都能十分方便地前往各个景点。"
      }, {
        typename: "title",
        text: "第一天行程"
      }, {
        typename: "article",
        text: "今天来一场悠闲的丽江古城漫步游，感受最柔软舒适的古城时光吧。不大的丽江古城中，包含着纳西族皇宫木府、开满小吃铺子的四方街、灯火酒绿的艳遇酒吧等各种元素。"
      }],
      scheme: [{
        id: 1,  //景点编号
        keywords: "大水车",
        longitude: 100.233220,
        latitude: 26.876170,
        address: "云南省丽江市古城区东大街1号丽江古城内",
        distance: "0.4公里",
        iconurl: "../../assets/scenery.png",
        text: "和大水车合影留念",
        subtext: "丽江.建议玩半小时",
        texts: [
          "/assets/s1.jpg",
          "走进丽江古城北门，一大一小两架水车便映入眼帘。这两驾连轴大水车是古城的标志性建筑，也是古城内最人声鼎沸的地方，一年四季都挤满了留影和集合的游客，想要单独和水车合影一张必须眼尖手快。",
          "大水车前的石桥上，是拍摄水车的最佳地点。若是春天的傍晚前来，夕阳穿过水车，照射在一旁刻有江泽民题词的照壁上，碧绿的垂柳被微风拂动，潺潺的流水反射着碎金般的阳光，是大水车最美的一面。"
        ]
      }, {
        id: 2,
        keywords: "四方街",
        longitude: 100.233950,
        latitude: 26.872040,
        address: "云南省丽江市古城区古城中心",
        distance: "0.2公里",
        iconurl: "../../assets/scenery.png",
        text: "逛四方街品尝纳西美食",
        subtext: "丽江.距上一站0.4公里.建议玩半小时",
        texts: [
          "/assets/s2.jpg",
          "丽江虽然不以美食而著称，但是却有很多有纳西族代表性的特色小吃，这其中以鸡豆凉粉、纳西烤鱼、丽江粑粑等最受欢迎。走在丽江古城的四方街上，短短的街道上有数十家小吃店，让你一次吃遍各种纳西小吃。",
          "除了小吃外，丽江特色火锅也非常出名，以腊排骨火锅、洋芋鸡火锅、黑山羊火锅、菌类火锅等最美味。丽江的火锅有招牌蘸水，最好可以放一些薄荷涮在肉锅里，肉会带有清新的香味，薄荷混了肉味，非常好吃。",
          "若要想吃正宗纳西菜，比较具有代表性的有三叠水和八大碗。“三叠水”是纳西人的最高礼仪，按所上菜看的口味分三次上席；“八大碗”则是纳西族传统的年夜饭，以八种各有寓意的菜式致以美好祝福。"
        ]
      }, {
        id: 3,
        keywords: "狮子山",
        longitude: 100.232550,
        latitude: 26.870880,
        address: "云南省丽江市古城区狮子山公园内",
        distance: "0.3公里",
        iconurl: "../../assets/scenery.png",
        text: "登狮子山俯瞰丽江古城全景",
        subtext: "丽江.距上一站0.2公里.建议玩半小时",
        texts: [
          "/assets/s3.jpg",
          "丽江古城西侧的狮子山顶，是观赏丽江古城全景的最佳去处，可北望玉龙雪山，东俯丽江古城，西瞰丽江新城，南眺田园风光。晚上在狮子山俯瞰丽江，月色下在万家灯火装点下的古城更是流光溢彩，璀璨动人。",
          "狮子山因山体宛如一头睡卧的狮子而得名，山顶坐落着极富建筑特色的万古楼，是丽江城内的制高点。公园南端有始建于乾隆十九年的白马龙潭寺，寺东有一泓清澈见底的潭水，被纳西人民奉为神泉。"
        ]
      }, {
        id: 4,
        keywords: "木府",
        longitude: 100.234600,
        latitude: 26.869080,
        address: "云南省丽江市古城区大研镇光义街",
        distance: "0.3公里",
        iconurl: "../../assets/scenery.png",
        text: "木府：精致雄伟的丽江王府",
        subtext: "丽江.距上一站0.3公里.建议玩1小时",
        texts: [
          "/assets/s4.jpg",
          "丽江古城内的木府，是历代丽江木氏土司的王府。土司府在保持了中原建筑风格的基础上，添加了白族和纳西族的工艺，建筑精美而宏大，蔚为壮观，难怪徐霞客当年在木府门外慨叹：“宫室之丽，拟于王者”。",
          "木府虽是土司王府，但宫室之瑰丽，不逊皇家，据说当年既是“仿紫禁城而建”，鼎盛时期，有宫舍100多间。府内中轴线上建有忠义牌坊、木牌坊、议事厅、万卷楼等建筑，高低错落，气势磅礴。",
          "木府历经几百年的辉煌，大部分毁于清末的战火中，目前所见的绝大多数是1999年重建而成。虽是重建，但不妨碍其成为丽江古城内的代表性建筑。电视连续剧《木府风云》、《钱王》都是在这里拍摄的。"
        ]
      }, {
        id: 5,
        keywords: "四方街",
        longitude: 100.233950,
        latitude: 26.872040,
        address: "云南省丽江市古城区古城中心",
        distance: "0.6公里",
        iconurl: "../../assets/scenery.png",
        text: "跳一次纳西广场舞",
        subtext: "丽江.距上一站0.3公里.建议玩半小时",
        texts: [
          "/assets/s5.jpg",
          "每逢节庆日，丽江的纳西族的小伙子都要面对玉龙雪山，敲着“东巴鼓”，跳起欢快的东巴舞。如今在四方街上，几乎每天都有穿着民族服饰欢快起舞的纳西族，和他们一起跳一次广场舞，绝对会是难得的体验。",
          "东巴舞是纳西族东巴文化的重要组成部分，一般运用于宗教祭祀活动中。东巴舞来源于古代纳西的社会生活，不少动作都是模拟各种动物的动作来进行的，形象十分生动。"
        ]
      }, {
        id: 6,
        keywords: "江湖酒吧",
        longitude: 100.239620,
        latitude: 26.870820,
        address: "云南省丽江市古城区五一街王家庄巷41",
        iconurl: "../../assets/scenery.png",
        text: "泡一泡丽江酒吧",
        subtext: "丽江.距上一站0.6公里",
        texts: [
          "/assets/s6.jpg",
          "如果说白天的丽江古城是民俗与美景的结合，那么夜幕降临后的丽江则不负其“艳遇之都”的美誉。古城内大大小小的酒吧纷纷开张，在鲜艳的霓虹灯下，素不相识的人们聚在一起，饮酒作乐。",
          "丽江城内酒吧众多，最具特色的当属火塘酒吧了。火塘是藏区家中生火取暖、聚会的地方，一年365天都不会熄灭。在火塘酒吧中，歌手和客人围坐在火塘周边，自弹自唱、谈天说地、其乐融融。",
          "江湖酒吧是丽江最热门的火塘音乐酒吧，也是音乐爱好者们在丽江的聚集点之一。江湖酒吧的主唱小松声音穿透力很强，伴随着让人回味无穷的音乐声，不大的酒吧中男男女女围着一个大火塘谈笑风生，十分惬意。"
        ]
      }]
    }, {  //第二天
      id: 2,
      title: "DAY2 丽江",
      subtitle: [{
        typename: "article",
        text: "想比人潮涌动的丽江，束河古城少了一份古朴的安静。小城景点不多，你可以猫进一个安静的角落，沏上一壶云南特产的普洱香茶，与三五好友发呆聊天晒太阳。"
      }],
      scheme: [{
        id: 11,  //景点编号
        keywords: "束河古镇",
        longitude: 100.207360,
        latitude: 26.914880,
        address: "云南省丽江市古城区束河路",
        distance: "0.4公里",
        iconurl: "../../assets/scenery.png",
        text: "束河古城喝茶晒太阳",
        subtext: "丽江.距上一站5.9公里",
        texts: [
          "/assets/s11.jpg",
          "束河古城比起丽江古城，少了一份喧嚣，多了一份古朴和安静。这里四季气候宜人，阳光充足，猫进一个安静的角落，沏上一壶云南特产的普洱香茶，与三五好友发呆聊天晒太阳，便是最美好的柔软时光。",
          "束河古镇是纳西族在丽江坝子最早的聚居地之一，更是当年茶马古道上的重要驿站。古镇环境古朴而清幽，由于旅游开发较晚，比丽江古城要幽静的多。如果纠结于大研古镇的喧嚣，不妨来这里小住几日。"
        ]
      }, {
        id: 12,  //景点编号
        keywords: "束河四方街",
        longitude: 100.204530,
        latitude: 26.921480,
        address: "云南省丽江市古城区束河古镇内",
        distance: "0.5公里",
        iconurl: "../../assets/scenery.png",
        text: "三眼井：独特又环保的用水方式",
        subtext: "丽江.距上一站0.4公里.建议玩半小时",
        texts: [
          "/assets/s12.jpg",
          "在束河古镇里，分布着不少纳西族人独特的三眼井。三眼井利用地势高差修建成三级水潭，每个水潭都有各自的用途，由上而下分别为人饮用、淘米洗菜用和洗衣，体现了纳西人淳朴的节水环保理念。",
          "三眼井在束河古镇内主要分布在四方听音广场、九鼎龙潭附近。除了束河古镇外，丽江古城内也分布着五口三眼井，分别在白马龙潭、义尚甘泽泉、光碧巷、格宝坞和寄宝坞。"
        ]
      }, {
        id: 13,  //景点编号
        keywords: "茶马古道博物馆",
        longitude: 100.205390,
        latitude: 26.922080,
        address: "云南省丽江市古城区束河古镇老四方街北侧",
        distance: "0.2公里",
        iconurl: "../../assets/scenery.png",
        text: "参观茶马古道博物馆",
        subtext: "丽江.距上一站0.5公里.建议玩1小时",
        texts: [
          "/assets/s13.jpg",
          "茶马古道博物馆也称大觉宫，是明代木氏土司“束河院”建筑群的组成部分。博物馆以茶马古道文化、束河当地风俗和普洱茶文化为主题，向游客展示着茶马古道悠久的历史与独特的文化，非常值得参观。",
          "历史上的茶马古道起于滇南，经过大理、丽江、迪庆、拉萨，止于印度。茶马古道以马帮文化为主，贩运茶叶、骡马、布匹和生活用具等，是一条“南方丝绸之路”，也留下了众多的文化风俗和历史故事。"
        ]
      }, {
        id: 14,  //景点编号
        keywords: "九鼎龙潭",
        longitude: 100.203950,
        latitude: 26.924210,
        address: "云南省丽江市古城区束河路(龙泉路口)丽江束河古镇内",
        iconurl: "../../assets/scenery.png",
        text: "绕清澈见底的龙泉走一圈",
        subtext: "丽江.距上一站0.2公里.建议玩半小时",
        texts: [
          "/assets/s14.jpg",
          "龙泉又称九鼎龙潭，位于束河古镇的西北角，是古镇内比较主要的景点之一。龙潭是古镇上溪流的水源地，依山傍河，面积不大，不过潭水清澈见底，周围绿树环绕，在潭边漫步观景非常不错。",
          "龙潭中间有一个凉亭，是欣赏潭水最好的地方，可以看到很多游鱼在水中摇曳，令人十分舒心惬意。传说古时曾经有人想在潭水中捕鱼，结果当时电闪雷鸣，从此当地人再也不敢在龙潭中捕鱼。"
        ]
      }]
    }, {  //第三天
      id: 3,
      title: "DAY3 丽江",
      subtitle: [{
        typename: "article",
        text: "丽江城北的玉龙雪山是纳西族心中的神山，这里景观丰富，游客可以上山欣赏高海拔冰川的瑰丽景象，也可以在山腰欣赏蓝月谷的碧水、云杉坪的参天古木。除了自然景观外，蓝月谷每天中午都会上演的《印象丽江》舞台剧也不可错过。"
      }],
      scheme: [{
        id: 7,
        keywords: "玉龙冰川公园",
        longitude: 100.254410,
        latitude: 27.099090,
        address: "云南省丽江市玉龙纳西族自治县玉龙雪山景区内",
        distance: "8.1公里",
        iconurl: "../../assets/scenery.png",
        text: "登玉龙雪山近距离观赏冰川",
        subtext: "丽江.距上一站19公里.建议玩2-3小时",
        texts: [
          "/assets/s7.jpg",
          "位于丽江古城旁的玉龙雪山，是北半球纬度最低的雪山，山上发育着19条冰川，远望如同一片瀑布悬挂于山顶，在阳光的照耀下泛着银光。乘坐大索道前往山腰，沿着山间栈道就可以近距离观赏冰川。",
          "玉龙雪山上的冰川公园是玉龙雪山的主峰扇子陡东北坡一片平缓坡地，白色的山体即磅礴壮观又洁白清秀。这里秋冬春三季白雪茫茫，但到了夏季时，形成于四万多年前的白水一号冰川则裸露在外，游客可以近距离观察。"
        ]
      }, {
        id: 8,
        keywords: "印象丽江",
        longitude: 100.258430,
        latitude: 27.097400,
        address: "云南省丽江市玉龙纳西族自治县雪山国家风景名胜区内",
        distance: "3.4公里",
        iconurl: "../../assets/scenery.png",
        text: "看一场《印象丽江》",
        subtext: "丽江.距上一站8.1公里.建议玩2小时",
        texts: [
          "/assets/s8.jpg",
          "《印象丽江》是张艺谋导演的大型实景舞台剧，将云南少数民族的生活、耕种、爱情、狩猎、欢庆、行商等各种元素，用艺术的形式展现在人们的眼前，全视角的呈现了东巴文化的风貌。",
          "《印象丽江》的演员大部分都是当地居民，演出在海拔3100米的玉龙雪山甘海子蓝月谷剧场露天舞台举行，用最淳朴的演员与最真实的场景，展示出丽江原住民对天地、山川的感情。",
          "整个表演一气呵成，搭配蓝天白云雪山的真实背景，让人仿佛置身于其中。在震撼的背景音乐里，你能触及到纳西族人生命里的顽强与不息；回荡在雪山上的情歌，让你感受纳西族青年男女那纯净的爱情。"
        ]
      }, {
        id: 9,
        keywords: "蓝月谷",
        longitude: 100.244680,
        latitude: 27.125830,
        address: "云南省丽江市玉龙纳西族自治县玉龙雪山景区内",
        distance: "0.1公里",
        iconurl: "../../assets/scenery.png",
        text: "蓝月谷：水色碧蓝小九寨",
        subtext: "丽江.距上一站3.4公里.建议玩1-2小时",
        texts: [
          "/assets/s9.jpg",
          "蓝月谷原名“白水河”，每逢晴天，月牙形山谷中的湖水都会呈现出蔚蓝的颜色，因而得名。 蓝月谷被称为“小九寨”，这里的湖光山色虽然比不上九寨沟的绝美和静谧，但在雪山的映衬下也别有一番韵味。",
          "蓝月谷位于玉龙雪山脚下，湖水都是由雪山融水汇聚而成，清澈见底。水中富含钙、铜等金属离子，因此形成了钙华地貌，以及蔚蓝色的池水。谷中的河水受山体阻挡，形成了玉液湖、镜潭湖、蓝月湖等湖泊。"
        ]
      }, {
        id: 10,
        keywords: "云杉坪",
        longitude: 100.234920,
        latitude: 27.129710,
        address: "云南省丽江市玉龙纳西族自治县玉龙雪山",
        iconurl: "../../assets/scenery.png",
        text: "云杉坪：玉龙雪山最佳拍摄地",
        subtext: "丽江.距上一站0.1公里.建议玩2-3小时",
        texts: [
          "/assets/s10.jpg",
          "云杉坪是玉龙雪山山腰上的一片高山草甸，草场周边被高大茂密的云杉林所环抱。在这个海拔3200米的草甸上，可以将玉龙十三峰的壮观景象一览无余，是拍摄雪山的最佳取景点。",
          "云杉坪又名“殉情谷”，传说是以前有很多青年男女在此殉情，因而成为了纳西青年男女心中的爱情圣地。前往云杉坪需要在玉龙雪山景区内乘坐云杉坪索道，穿过茂密繁盛的云杉林之后，便可来到草场。"
        ]
      }]
    }, {   //第四天
      id: 4,
      title: "DAY4 丽江",
      subtitle: [{
        typename: "article",
        text: "\"骑马\"与\"泛舟\"是今日游玩的关键词。上午乘船游玩拉市海，运气好还可以拍到遮天蔽日的水鸟群；下午在附近的马场租一匹骏马，沿着茶马古道骑行。临走别忘了品尝一下这里独特的淡水三文鱼，一鱼三吃十分美味。"
      }],
      scheme: [{
        id: 15,
        keywords: "拉市海",
        longitude: 100.146100,
        latitude: 26.862360,
        address: "云南省丽江市玉龙纳西族自治县大丽高速",
        distance: "0公里",
        iconurl: "../../assets/scenery.png",
        text: "拉市海：泛舟游览湿地公园",
        subtext: "丽江.距上一站30公里.建议玩半天",
        texts: [
          "/assets/s15.jpg",
          "丽江市城西10公里外，有一片水丰草美的湿地，叫做拉市海。海子鱼虾成群，每年秋冬都会吸引众多候鸟前来。最佳的游览方式当属泛舟湖上，低头可以看到清澈湖水中的游鱼，抬头则是蓝天映衬下的飞鸟。",
          "拉市海的四周都是纳西村庄，每个临湖的村子都开辟了马场，带游人骑马观景和划船休闲。你可以上船家吃着烤鱼在湖上缓缓划行；也可以玩一个骑马环湖长线，听马夫讲述那些陈年的纳西往事。"
        ]
      }, {
        id: 16,
        keywords: "茶马古道",
        longitude: 100.133090,
        latitude: 26.894070,
        address: "云南省丽江市玉龙纳西族自治县拉市海均良村木家寨(花花色玫瑰庄园旁)",
        distance: "4.5公里",
        iconurl: "../../assets/scenery.png",
        text: "骑马重走茶马古道",
        subtext: "丽江.距上一站0公里.建议玩2小时",
        texts: [
          "/assets/s16.jpg",
          "在丽江拉市海附近的骑马缓缓而行，感受千年前行商开辟的茶马古道。骑行在保护完好的的高原植被中，极目远眺玉龙雪山，山花烂漫，满眼青翠；俯瞰拉市海湿地，如同一颗明珠镶嵌在群山中。",
          "茶马古道源于古代西南边疆的茶马互市，兴于唐宋，是世界上地势最高的文明传播古道之一。丽江周边的拉市海有两条骑马体验线路，线路在3-6个小时左右。马夫多为当地居民，靠着养马领游客逛古道为生。"
        ]
      }, {
        id: 17,
        keywords: "三文鱼火锅",
        longitude: 100.150370,
        latitude: 26.902730,
        address: "云南省丽江市玉龙纳西族自治县茶马古道附近",
        iconurl: "../../assets/scenery.png",
        text: "三文鱼火锅：雪水滋养的佳肴",
        subtext: "丽江.距上一站4.5公里",
        texts: [
          "/assets/s17.jpg",
          "丽江的三文鱼，并非我们所熟悉的海产三文鱼，而是本土改良种虹鳟鱼。经过玉龙雪山雪水滋养的三文鱼，肉质细嫩、口感爽滑，可以吃生鱼片，也可以在锅里涮着吃，都是食客们赞不绝口的美味佳肴。",
          "除了涮火锅外，毗邻拉市海的美泉三文鱼食府以一鱼三吃而闻名。"
        ]
      }]
    }]




  }];
}
function getLineById(id) {
  var item = null;
  var lines = getLines();
  for (var i = 0; i < lines.length; i++) {
    var line = lines[i];
    if (line.id == id) {
      item = line;
      break;
    }
  }
  return item;
}


///////////////////////获取资讯数据
function getNews() {
  return [{
    types: "ad",
    id: 1,
    title: "丽江旅游警察：守护节日平安",
    imgurl: "../../assets/news/new1.jpg",
    content: {
      title: "丽江旅游警察：守护节日平安",
      subtitle: "云南丽江警方 06-01 11:19",
      news: [{
        types: "text",
        id: "1",
        content: "2017年端午节期间，丽江全市旅游警察队伍坚守在工作岗位，守护着节日平安，实现了旅游核心区警力全覆盖，确保了全市各旅游景区景点秩序井然，营造了良好的旅游治安环境。"
      }, {
        types: "img",
        id: "2",
        imgurl: "../../assets/news/new1_1.jpg",
        content: "旅警支队 加强节假日值班备勤"
      }, {
        types: "text",
        id: "3",
        content: "为切实担负起端午假期的应急值班备勤工作，旅游警察支队科学调整警力，强化值班备勤，每天安排22名警力在岗在位，加强旅游核心区及景区景点的的巡查力度，深入拉市海马场开展安全检查，将警务工作延伸到景区景点和游客身边，第一时间接受群众的报警、投诉、求助和咨询，为群众排忧解难，全面提升游客和群众的安全感。在马场划船点，巡查民警发现游客大多不按要求穿戴救生衣出海划船，安全隐患非常大，于是责令划船点负责人做好游客划船安全提示，要求游客必须穿戴救生衣等防护装备方能上船；在大研古城，支队领导带队开展社会面巡逻防控，开展酒吧不间断巡查，形成高压管控态势，力求侵犯游客人身财产安全的违法犯罪行为得到有效控制；在观音峡景区，巡查民警发现水上玻璃栈道上未张贴安全提示牌，于是要求景区负责人尽快制作并张贴。"
      }, {
        types: "img",
        id: "4",
        imgurl: "../../assets/news/new1_2.jpg",
        content: "古城 全力维护旅游市场治安秩序稳定"
      }, {
        types: "text",
        id: "5",
        content: "针对端午节期间大研古城、束河古镇等重点景区景点人流量增大的实际，古城公安分局旅游警察大队为确保端午节期间辖区旅游治安秩序持续稳定，及时安排警力对辖区涉旅行业场所以及购物店进行了检查，并告诫检查单位依法依规经营，杜绝欺骗宰客的行为。严密防范、严厉打击“酒托”等侵害游客人身、财产安全的违法犯罪活动。同时，采取有力措施，切实维护景区的治安秩序，对游客较多、安全情况复杂的部位、路段和地段，增派人员积极开展秩序疏导，配合交管部门做好重点路段的交通管理与疏导；与景区管理部门保持信息畅通，一旦发现景区内游客人数接近安全容量，迅速采取停止售票、暂停游客进入等措施，并及时做好出入引导，确保景区点秩序安全有序。期间，古城分局旅游警察部门共出动警力568人次,车辆175辆次，清查行业场所410家，调解旅游纠纷5起，救助服务游客13起。"
      }, {
        types: "img",
        id: "6",
        imgurl: "../../assets/news/new1_3.jpg",
        content: "玉龙 加大景区景点巡逻防控"
      }, {
        types: "text",
        id: "7",
        content: "为确保节假日辖区旅游市场的安全与稳定，玉龙县公安局旅游警察大队首先着重加强对拉市海湿地公园旅游景区及周边骑马场及涉旅场所的巡逻防控工作，及时处理涉旅矛盾纠纷，坚持“守点、巡线、防片、管面”的工作模式，最大限度地提升街面见警率和管事率，有效提升治安管控、服务游客能力，严厉打击旅游市场违规违法行为。同时，在工作中加大对旅游安全防范知识宣传，努力营造假日旅游良好的氛围。期间，旅游警察大队联合中队共出动警力390人次，巡逻车90辆次，检查涉旅场所102家，发现消防安全隐患1家，已当场整改，救助游客15起。"
      }, {
        types: "img",
        id: "8",
        imgurl: "../../assets/news/new1_4.jpg",
        content: "宁蒗 全警投入“摩梭猪槽船大赛”安保任务"
      }, {
        types: "text",
        id: "9",
        content: "宁蒗县公安局旅游警察大队根据工作实际，全警投入端午节“二〇一七年摩梭猪槽船大赛”安保任务中。据悉，本届赛事在泸沽湖大落水码头举行，参加群众及游客接近1万人次。通过所有参加安保警力的共同努力，“二〇一七年摩梭猪槽船大赛”安保任务圆满完成。安保之余，宁蒗县公安局旅游警察大队积极参与端午节期间社会面治安防控，期间联合派出所中队共出动警力145人次，车辆12辆次，检查旅游行业场所68家，调解旅游纠纷4起。"
      }, {
        types: "img",
        id: "8",
        imgurl: "../../assets/news/new1_5.jpg",
        content: "供稿/旅警支队"
      }]
    }
  }, {
    types: "new",
    id: 2,
    title: "16岁以下孩子的福利 暑假游丽江门票免费",
    imgurl: "../../assets/news/new2.jpg",
    time: "2017-05-22 13:01",
    content: {
      title: "16岁以下孩子的福利 暑假游丽江门票免费",
      subtitle: "丽江新声 05-22 13:01",
      news: [{
        types: "text",
        id: "1",
        content: "小伙伴们，有好消息来啦！暑假期间来丽江旅游，一堆免费和打折项目，有木有心动？小编从丽江中国旅游日云南分会场启动仪式了解到从2017年6月15日--8月25日，总共70天，丽江一些重点景区对国内外16周岁以下的中小学生免费，星级酒店、飞机等也对这类学生打折。"
      }, {
        types: "img",
        id: "2",
        imgurl: "../../assets/news/new2_1.jpg",
        content: "图1"
      }, {
        types: "text",
        id: "3",
        content: "优惠人群：国内、国外（海外）16周岁以下中小学生；优惠时间：2017年6月15日——8月25日，共70天；优惠政策："
      }, {
        types: "img",
        id: "4",
        imgurl: "../../assets/news/new2_2.jpg",
        content: "图2"
      }, {
        types: "text",
        id: "5",
        content: "景区（点）门票优惠政策：“大玉龙”套票及各景区（点）门票：玉龙雪山（AAAAA）、东巴谷（AAAA）、玉水寨（AAAA）、东巴万神园（AAA）、东巴王国（AA）、玉柱擎天（AA）、白沙壁画（AAA）、玉峰寺（AA）；老君山景区（AAAA）、束河古镇（AAAA）、泸沽湖景区（AAAA）、观音峡景区（AAAA）、木府、古城万古楼，给予免票的优惠政策；宋城丽江千古情景区：给予1.2米以下中小学生免门票的优惠，1.2-1.5米中小学生给予在门票原价基础上优惠40元的政策。玉龙雪山索道（大索道、云杉坪索道、牦牛坪索道）优惠政策：1.2米及以下中小学生给予全免索道票（不含保险）的优惠，1.2米以上中小学生给予索道票半价优惠（不含保险）的政策。"
      }, {
        types: "img",
        id: "6",
        imgurl: "../../assets/news/new2_3.jpg",
        content: "图3"
      }, {
        types: "text",
        id: "7",
        content: "民族演艺优惠政策：丽水金沙、印象丽江、云南的响声，给予免票的优惠政策；宋城丽江千古情：给予1.2米以下中小学生免票的优惠，1.2-1.5米中小学生给予在票价基础上优惠40元的政策（豪华席位不参与优惠活动）。"
      }, {
        types: "img",
        id: "8",
        imgurl: "../../assets/news/new2_4.jpg",
        content: "图4"
      }, {
        types: "text",
        id: "9",
        content: "航空机票优惠政策：凡通过直航形式进出港丽江的国内中小学生给予最大折扣的优惠上海吉祥航空公司：所有航线12周岁以下学生一律给予五折优惠（更多优惠政策见吉祥航空官方网站）；中国东方航空公司：所有丽江进港航班五折优惠起，先购先得（具体优惠价格以东航各大直销和分销系统实时为准），优惠时间：2017年6月15日-7月10日；四川航空公司：对丽江出港航班给予五折优惠，时间：2017年6月20日-8月25日；祥鹏航空公司：根据不同航段、航班给予2折-5折不等的最大优惠（具体优惠价格以祥鹏航空各大直销和分销系统实时为准），实行先购先得政策，优惠时间：2017年6月15日-7月10日。"
      }, {
        types: "img",
        id: "10",
        imgurl: "../../assets/news/new2_5.jpg",
        content: "图5"
      }, {
        types: "text",
        id: "11",
        content: "优惠形式：凡符合优惠政策的中小学生凭学生证、身份证、户口簿或护照等有效证件（原件），均可享受以上各项优惠政策。旅游咨询服务和投诉监督电话：丽江市旅游咨询服务电话：0888-5111169丽江市旅游投诉电话：0888-5123432、12301"
      }]
    }
  }, {
    types: "new",
    id: 3,
    title: "丽江五一接待游客9.69万人次 实现旅游“零投诉”",
    imgurl: "../../assets/news/new3.jpg",
    time: "2017-05-02 14:07",
    content: {
      title: "丽江五一接待游客9.69万人次 实现旅游“零投诉”",
      subtitle: "网易云南 05-02 14:07",
      news: [{
        types: "text",
        id: "1",
        content: "2017年“五一”黄金周期间丽江市共计接待海内外游客9.69万人次，同比下降3.84%；旅游总收入11689.78万元，同比下降6.58%。"
      }, {
        types: "img",
        id: "2",
        imgurl: "../../assets/news/new3_1.jpg",
        content: "图1"
      }, {
        types: "text",
        id: "3",
        content: "2017年“五一”黄金周期间丽江市共计接待海内外游客9.69万人次，同比下降3.84%；旅游总收入11689.78万元，同比下降6.58%。"
      }, {
        types: "text",
        id: "4",
        content: "5月2日，网易云南从丽江市假日旅游协调领导小组办公室了解到，2017年“五一”黄金周期间丽江市共计接待海内外游客9.69万人次，同比下降3.84%；旅游总收入11689.78万元，同比下降6.58%。"
      }, {
        types: "text",
        id: "5",
        content: "“五一”期间，丽江旅游满意度提升。游客投诉持续下降，整个节日期间无游客投诉案件，实现了旅游“零投诉”。由于假期较短，远行出游的少，丽江人游丽江的多，团队来丽游客人数也相对平稳，没有出现过热、火爆的态势。同时，因各旅行社的旅游产品、旅游线路及操作流程处于调整期，团队数量近期有所下降，散客增多。"
      }, {
        types: "text",
        id: "6",
        content: "据悉，节假日期间，丽江市旅游部门积极做好旅游服务工作，全市旅游市场运行平稳，未发生重大旅游安全事故和旅游投诉。"
      }]
    }
  }, {
    types: "ad",
    id: 4,
    title: "一大波野生菌正在接近",
    imgurl: "../../assets/news/new4.jpg",
    content: {
      title: "一大波野生菌正在接近,云南发布食用野生菌中毒预警",
      subtitle: "自驾旅游网 06-03 08:45",
      news: [{
        types: "text",
        id: "1",
        content: "最近上市的野生菌随着雨季来临，野生菌进入生长旺季，即将大量上市。为遏制、防范食用有毒野生菌造成食物中毒事件发生，5月17日，云南省卫生计生委发布2017年预防食用野生菌中毒预警，要求学校、单位、建筑工地食堂、农村客堂、婚宴丧请和会议涉及集体用餐、旅游团队用餐等严禁加工食用、售卖野生菌。省卫生计生委要求餐饮经营单位要严把野生菌采购关，严格加工，指导消费者安全食用"
      }, {
        types: "img",
        id: "2",
        imgurl: "../../assets/news/new4_1.jpg",
        content: "图1"
      }, {
        types: "text",
        id: "3",
        content: "跟着雨季光降，野生菌进入发展旺季，即将大量上市。为遏制、提防食用有毒野生菌造成食品中毒变乱产生，5月17日，云南省卫生计生委发布2017年防备食用野生菌中毒预警，要肄业校、单元、建筑工地食堂、屯子客厅、婚宴丧请和会议涉及集体用餐、旅游团队用餐等严禁加工食用、售卖野生菌。"
      }, {
        types: "img",
        id: "4",
        imgurl: "../../assets/news/new4_2.jpg",
        content: "图2"
      }, {
        types: "text",
        id: "5",
        content: "省卫生计生委要求餐饮经营单元要严把野生菌采购关，严厉加工，引导消耗者平安食用野生菌，落实留样备查轨制，确保消耗者食用平安。加大对涉及群体性用餐单元的宣传及搜检力度，严禁其加工食用野生菌，一经发明违法违规行为，严正查处，避免产生野生菌引起的群体性食品中毒变乱。强化应急值守，实时处理各种食物平安投诉举报案件，增强区域间、部分间信息沟通与协作，谨防食品中毒事故的产生，确保人民群众饮食平安。并增强对食物平安事故应急预案的进修，做好食物平安突发变乱应急预备事情，医疗机构做好食品中毒应抢救治的各项预备事情，卫生、疾控和食药监（市场监管）、公安等部分各司其职，组建应急步队，开展应急培训，做好应急预备事情，确保一旦产生食用野生菌中毒变乱，能快速有用措置，避免风险扩大及事态伸张。"
      }, {
        types: "img",
        id: "6",
        imgurl: "../../assets/news/new4_3.jpg",
        content: "图3"
      }, {
        types: "text",
        id: "7",
        content: "此外，跟着夏日的到来，食物容易靡烂变质，产生细菌性食品中毒的危害加大。云南省食物药品监视治理局也发布了年夏日食物平安预警，对食品中毒变乱的高发区，稀奇是容易引起群体性食物平安变乱的学校食堂、自办集体宴席、建筑工地食堂等集中就餐场合进行重点预警和提示。"
      }, {
        types: "text",
        id: "8",
        content: "省食药局提示，消耗者在餐饮消耗过程中如发明食物平安问题，或显现猛烈吐逆、腹泻等可疑食品中毒症状时，实时就近到正规病院治疗，并拨打食物药品投诉举报德律风12331；供餐单元要立刻封存导致或者可能导致食物平安事故的食物及其质料、对象器具、设备设施和现场，实时向当地食物药品监管部分申报，并自动共同有关部分接纳掌握步伐。"
      }]
    }
  }, {
    types: "new",
    id: 5,
    title: "七月来丽江火一把！就到这个地方来一场篝火晚会吧！",
    imgurl: "../../assets/news/new5.jpg",
    time: "2017-05-23 13:47",
    content: {
      title: "七月来丽江火一把！就到这个地方来一场篝火晚会吧！",
      subtitle: "丽江老君山 05-23 13:47",
      news: [{
        types: "text",
        id: "1",
        content: "火把节是云南彝族、白族、纳西族等少数民族古老而重要传统节日，有着深厚的民俗文化内涵，名扬海内外，也称“星回节”，每年的火把节按农历“星回”计算，通常在农历六月二十五开始，一般举行三天，被誉为“东方的狂欢节”。"
      }, {
        types: "img",
        id: "2",
        imgurl: "../../assets/news/new5_1.jpg",
        content: "图1"
      }, {
        types: "text",
        id: "3",
        content: "在离自己车水马龙的城市的另一边有一群人，拥有自己独特的文化和生活方式他们会在火把节的这一天用不同的方式庆祝"
      }, {
        types: "img",
        id: "4",
        imgurl: "../../assets/news/new5_2.jpg",
        content: "图2"
      }, {
        types: "text",
        id: "5",
        content: "只是在新闻上看到、只是在网上看到、只是在工作的空余看到、只是向往到"
      }, {
        types: "img",
        id: "6",
        imgurl: "../../assets/news/new5_3.jpg",
        content: "图3"
      }, {
        types: "text",
        id: "7",
        content: "相信很多人听说过火把节，它在云南与泼水节形成“冰火两重天”的狂欢景象。火把节是云南彝族、白族、纳西族等少数民族古老而重要传统节日，有着深厚的民俗文化内涵，名扬海内外，也称“星回节”，每年的火把节按农历“星回”计算，通常在农历六月二十五开始，一般举行三天，被誉为“东方的狂欢节”。"
      }, {
        types: "img",
        id: "8",
        imgurl: "../../assets/news/new5_4.jpg",
        content: "图4"
      }, {
        types: "text",
        id: "9",
        content: "丽江的火把节热闹非凡，家家户户扎很多个松木火把，火把上缀满五彩的鲜花和各种水果。丽江黎明作为一个多民族的地方，火把节当然也不会冷清。美酒一杯，姑娘小伙跳起来，高歌一曲，远方的客人欢迎你到来。"
      }, {
        types: "img",
        id: "10",
        imgurl: "../../assets/news/new5_5.jpg",
        content: "图5"
      }, {
        types: "text",
        id: "11",
        content: "在丽江黎明，傍晚时分，村民就会从附近的村庄聚集到黎明红石街上的展演中心参加篝火晚会。黎明是一个傈僳族乡，他们能歌善舞，喜欢唱歌对调。有话不说，歌来唱；有情不表，舞来跳。只要天气允许，就不会间断……展演中心除了有歌舞表演外，还有一些民间艺人来表演绝技——上刀山下火海民俗表演，在领略大自然的鬼斧神工的杰作之时，让您的身心得到最多的愉悦。"
      }, {
        types: "img",
        id: "12",
        imgurl: "../../assets/news/new5_6.jpg",
        content: "图6"
      }, {
        types: "text",
        id: "13",
        content: "去看一看真正的丽江吧，在清晨微醺的晨光中走在古旧的石板路上，在寂静的小巷深处邂逅一位安静的纳西老人，去郊外找片开满鲜花的草地躺着看天，去黎明参加一次红火的篝火晚会……这样，才不算枉来一趟丽江。"
      }]
    }
  }, {
    types: "new",
    id: 6,
    title: "今天丽江上千人聚集金山，连周边大理的都来凑热闹了",
    imgurl: "../../assets/news/new6.jpg",
    time: "2017-04-09 09:32",
    content: {
      title: "今天丽江上千人聚集金山，连周边大理的都来凑热闹了",
      subtitle: "丽江读本 04-09 09:32",
      news: [{
        types: "text",
        id: "1",
        content: "“白子白女嘛爱跳舞哟，最爱跳那民族舞……”今天上午，一首《白子白女就是好》拉开了金山街道白族文化节的帷幕。"
      }, {
        types: "text",
        id: "2",
        content: "今天农历三月十三，是金山街道新团东山庙一年一度的庙会，也是第十届金山民俗文化节暨金山街道第三届精神文明建设总结表彰大会。一大早，东山庙前的灵泉广场上人山人海，来自金山、九河、石鼓和大理的代表队表演着他们拿手的歌舞……"
      }, {
        types: "img",
        id: "3",
        imgurl: "../../assets/news/new6_1.jpg",
        content: "现场"
      }, {
        types: "text",
        id: "4",
        content: "9时许，灵泉广场上聚集了身着白族、纳西族服饰的男男女女、老老少少，整条石新路被堵得水泄不通，路两旁摆满了各种小吃、农具和家常用品，熙熙攘攘，好不热闹。"
      }, {
        types: "text",
        id: "5",
        content: "半个小时后，一首白族民歌《白子白女就是好》拉开了今天活动的帷幕。“白子白女嘛爱跳舞哟，最爱跳那民族舞……”在丽江驼峰乐队的伴奏下，歌手赵松梅演唱的这首歌，让熙熙攘攘的人群一下子安静下来。"
      }, {
        types: "text",
        id: "6",
        content: "来自新团洪家村的李嬢嬢也不由自主地跟着唱了起来，“这首歌我很熟悉，唱了好多年了。我年轻时比她唱得还好呢，哈哈……”"
      }, {
        types: "text",
        id: "7",
        content: "而在东山庙里，烧香的人也是络绎不绝，“进庙烧香拜佛，就是祈求平安，事事顺利。”来自大理鹤庆县的杨先生说。"
      }, {
        types: "text",
        id: "8",
        content: "据金山街道办事处相关负责人介绍，今年除举行文化节外，还增加了农具展销，“农具展销是为了方便周边居民，逛庙会的同时逛逛街，购买一些农用家具。”"
      }, {
        types: "text",
        id: "9",
        content: "活动一开始，就对金山街道2016年度精神文明建设工作先进集体和先进个人进行了表彰。金山卫生院、新文完小等29家单位、社区和团体被授予“文明单位”、“文明社区”和“先进集体”的称号。寸学军、和克伟等132人被授予“十星文明户”、“优秀干部”和“道德模范”称号。"
      }, {
        types: "text",
        id: "10",
        content: "表彰会上，古城区委常委、区委宣传部部长李润兰表示，东山脚下的金山，自明清以来，就是白族、纳西族的世代聚居地，从清末形成的“三月十三东山庙会”也成为了金山一张亮眼的文化名片。“时至今日，‘东山庙会’已经是古城区多元文化并行不悖和民族团结的典范。衷心希望金山民族文化节能够打造成基层民族文化建设品牌。”"
      }, {
        types: "text",
        id: "11",
        content: "值得庆贺的是，金山街道的“东山庙会”已被列入市级非物质文化遗产名录，丽江市文化广电新闻出版局局长余丽军在现场进行了授牌。"
      }, {
        types: "text",
        id: "12",
        content: "“今年，金山《东山庙会》还将被列为第四批省级非物质文化遗产名录。”李润兰说。"
      }, {
        types: "text",
        id: "13",
        content: "200多个节目上演，周边民众纷纷加入，据了解，东山庙供奉的东山老爷是金山白族的本主神。每年农历三月十三，金山民众就会在东山庙前举行民俗祭祀活动。"
      }, {
        types: "text",
        id: "14",
        content: "相传，明太祖朱元璋手下的韩成，随朱元璋与陈友谅决战于鄱阳湖时被围，无法脱险，韩成穿戴朱元璋的衣帽，投湖自尽救了朱元璋。其后代入滇进入鹤庆、丽江一带，随屯军屯垦留守后，念其先祖忠义之举，继建庙追思并奉为本主来供奉膜拜。时至今日，人们在祭拜东山老爷的同时，也将祈求风调雨顺的愿望融入其中。"
      }, {
        types: "text",
        id: "15",
        content: "从2008年始，金山街道将传统的东山庙会，以各村委会轮流坐庄的形式，举办成当地的民俗文化节，今年正是第十届，“规模一年比一年盛大。今年共有200多支队伍参加，共有220多个节目。除金山街道外，还有九河、石鼓、金安及大理鹤庆等周边地区的白族同胞参加。”金山街道相关负责人介绍道。"
      }, {
        types: "text",
        id: "16",
        content: "据悉，第十届金山民俗文化节为期三天，从今日起至4月11日结束。想去凑热闹的大伙儿可驾车沿石新路东行，也可乘13路公交车前往。"
      }]
    }
  }, {
    types: "new",
    id: 7,
    title: "百年难遇！吹、拉、弹、唱，看丽江这群最老的民间艺人怎么嗨",
    imgurl: "../../assets/news/new7.jpg",
    time: "2017-06-08 10:41",
    content: {
      title: "百年难遇！吹、拉、弹、唱，看丽江这群最老的民间艺人怎么嗨",
      subtitle: "丽江读本 06-08 08:25",
      news: [{
        types: "text",
        id: "1",
        content: " “弹指、敲打、拉扯、吟唱……”每一个动作汇成一组音符，形成美妙动听的乐曲。时而温柔如风，娓娓道来；时而气势如虹，荡气回肠。今天，一场古色古香的音乐演奏会，在束河古镇四方听音广场隆重举行。而这场演奏会最引人瞩目的不是它的外在气势，而是它赋予的内涵和时代意义。"
      }, {
        types: "img",
        id: "2",
        imgurl: "../../assets/news/new7_1.jpg",
        content: "图1"
      }, {
        types: "text",
        id: "3",
        content: "从昨晚开始，读本君的朋友圈就有不少网友在刷屏表示：“明天，丽江最老的民间艺人都将聚集于此，同台竞技看他们如何玩转洞经音乐，百年难遇啊！”"
      }, {
        types: "text",
        id: "4",
        content: "所以，到底是何事让一群耄耋之年的民间艺人聚集在一起呢？据读本君了解，今年的6月10日是我国首个“文化和自然遗产日”，也是“文化遗产日”更名后的第一个节日。为此，今明两天，中共古城区委宣传部主办发起以“非遗保护——传承发展的生动实践”为主题的纳西古乐演奏比赛暨非物质文化遗产宣传展示活动。"
      }, {
        types: "text",
        id: "5",
        content: "今日9时许，读本君便闻风而动。此时，四方听音广场已是人头攒动。广场中间布置好桌椅，两边竖起了非物质文化遗产宣传展示牌，所展示内容都是丽江的非物质文化遗产，包括服饰、歌舞、习俗、乐器等等。"
      }, {
        types: "img",
        id: "6",
        imgurl: "../../assets/news/new7_2.jpg",
        content: "图2"
      }, {
        types: "text",
        id: "7",
        content: "“玩古乐好多年了，基本天天都在练，没什么紧张的。”一位来自拉市美泉古乐队的老爷爷在上台前说道。"
      }, {
        types: "img",
        id: "8",
        imgurl: "../../assets/news/new7_3.jpg",
        content: "图3"
      }, {
        types: "img",
        id: "9",
        imgurl: "../../assets/news/new7_4.jpg",
        content: "图4"
      }, {
        types: "text",
        id: "10",
        content: "在演奏过程中，纳西老人们所用的乐器除了大家熟知的古筝、琵琶、二胡、笛子外，还有古老的纳西族特有的乐器，现场前来围观的游客、青年人，包括读本君都叫不出来名字，多为纳西族音译过来的古老乐器。"
      }, {
        types: "text",
        id: "11",
        content: "在展演台上，不仅80多岁的老翁，也有十几岁的青年人，他们全部来自民间，很多还是在地里劳作的农民。最远的乐师是从龙蟠、大具等地赶来，每个乐队由十几二十个人组成，共600多人参赛。按要求，30支参赛队伍都要演奏两首“丽江洞经音乐”选曲。其中，必选曲目为《八卦》，另一首为自选曲目。在现场读本君听到了《浪淘沙》、《山坡羊》、《柳摇金》、《清明老人》等曲目。"
      }, {
        types: "text",
        id: "12",
        content: "尽管读本君对纳西古乐的认识很浅，但当老艺术家们上台表演时，看到炎炎烈日下，台上一位位满脸沧桑的老人专注的神态，如痴如醉地演奏，瞬间感受到了他们对生活的热爱，对艺术的追求。也正因为他们对艺术的这一份执着，才得以让我们后世听到这么动听的古老乐曲。"
      }, {
        types: "text",
        id: "13",
        content: "30支民间传承队的表演让观众体会到了“只有民族的才是世界的”深刻内涵，让现代人感受到什么是经久不衰的艺术。"
      }]
    }
  }, {
    types: "new",
    id: 8,
    title: "独家发布丽江“爱心送考”最全预约电话！乘坐考生有机会获1万奖金",
    imgurl: "../../assets/news/new8.jpg",
    time: "2017-06-05 11:54",
    content: {
      title: "独家发布丽江“爱心送考”最全预约电话！乘坐考生有机会获1万奖金",
      subtitle: "丽江读本 06-05 11:54",
      news: [{
        types: "text",
        id: "1",
        content: "离今年高考仅仅只剩一天了！不止考生们会有点小紧张，家长们也跟着焦虑了起来。这不，这两天就有不少考生家长给读本君发来消息：“读本君，今年会有爱心送考吗？我们该坐什么车呢？”"
      }, {
        types: "text",
        id: "2",
        content: "带着这个家长和考生们关心的问题，读本君咨询了往年丽江会组织送考的单位得知，今年“爱心送考”将持续进行。由丽江市古城区玉龙县出租汽车联合协会（以下简称出租车协会）将派专门车辆作为“爱心送考”车接送考生。此外，丽江安通驾校也将继续今年高考的“爱心送考”活动。"
      }, , {
        types: "text",
        id: "3",
        content: "所以，各位考生和家长们，睁大眼睛看好了，到底怎样才能坐到“爱心送考”车，确保考生按时安全抵达考场呢？"
      }, {
        types: "text",
        id: "4",
        content: "安通驾校考上一本奖一千，北大清华奖一万还记得去年高考期间，安通驾校就组织了一场轰轰烈烈的“爱心送考”活动。但，今年跟往年不同的是，今年安通驾校为了鼓励考生、回馈市民家长，除了免费送考，还推出了“奖励活动”，只要是乘坐安通爱心送考车、并考上一本或者清华北大的学生，便可得到安通驾校1000-10000元不等的资助金。"
      }, {
        types: "text",
        id: "5",
        content: "据悉，在2017年6月7日—6月8日期间，凡是乘坐过安通驾校爱心送考车的学生，考取相关高校者，凭录取通知书即可获得丽江安通驾校的爱心资助金：搭乘安通驾校爱心送考车参加高考，并被一本院校录取的学生，安通驾校将对其提供1000元资助金；搭乘安通驾校爱心送考车参加高考，并被清华大学或者北京大学录取的学生，安通驾校将对其提供10000元资助金。"
      }, {
        types: "text",
        id: "6",
        content: "另据安通驾校相关负责人介绍，“为了保证资助金公平、公正、准确无误发放，希望乘坐的考生能配合教练员拍照留下相关信息。照片内容要包含教练员、送考车牌号、考生、准考证。”"
      }, {
        types: "text",
        id: "7",
        content: "重点提醒：乘坐方式和提前预约，据了解，这次爱心送考，丽江安通驾校安排了20辆爱心送考教练车、2辆应急爱心送考教练车。丽江市安通驾校校长杨树金表示，组织爱心送考就是想把爱心传递出去，让参加考试的孩子们安心考试、取得好成绩，以后到自己的工作岗位上也能爱心助人，“这次安排的教练都是经过精心挑选的具有A级以上水平的教练，他们熟悉道路交通法规，可以保证搭乘爱心送考车的学生的安全。”"
      }, {
        types: "text",
        id: "8",
        content: "从7日早上7点开始，开考前爱心送考教练车将穿行于市区大街小巷，对当天高考的考生实行路上挥手即停的方式接送，考生可凭准考证免费乘车。高考期间，每天上午、下午考试结束前，安通驾校爱心送考车辆将分别于11:10及16:40前到达各考点。"
      }, {
        types: "text",
        id: "9",
        content: "参加高考的学生可以提前通过热线电话0888-5311615预约车辆，同时赶考途中遇到需要求助的情况（如忘带准考证等），学生也可向就近的爱心送考教练员说明情况，教练员将在第一时间帮助考生尽快解决问题。"
      }, {
        types: "text",
        id: "10",
        content: "这样的好消息，赶紧告知家有考生的家庭，坐着安通驾校的车，奔着北大清华去吧~~~"
      }, {
        types: "text",
        id: "11",
        content: "360多辆“爱心送考”车，“一对一”可提前电话预约除了安通驾校组织的“送考活动”，读本君也从出租车协会获悉，今年协会的“爱心送考”从5月份就开始筹备车辆报名登记，目前已有360多辆“爱心送考”出租车。考生可提前电话预约，进行“一对一”的接送。这对于离考点较远的考生来说，真是提供了大大的方便。"
      }, {
        types: "img",
        id: "12",
        imgurl: "../../assets/news/new8_1.jpg",
        content: "图1"
      }, {
        types: "text",
        id: "13",
        content: "据出租车协会会长白锦红介绍，“爱心送考车”会在早上七点出发在街上巡游；11点回各考点；较偏远的考生也可直接联系预约送考车辆，“送考中可能会遇到过一些突发特殊情况，若今年有考试当天遇到交通堵塞等特殊情况的考生，也可直接拨打我们的预约电话。”"
      }, {
        types: "text",
        id: "14",
        content: "除了“爱心送考”车辆考前对考生的送考外，在丽江市一中、古城区一中、玉龙县一中三个考点门口出租车协会还设立了爱心服务区。在爱心服务区会有专门的站点给考生和考生家长提供免费矿泉水，以及为遇到突发事件的考生提供车辆服务，开通绿色通道。"
      }]
    }
  }, {
    types: "new",
    id: 9,
    title: "赛龙舟有什么稀奇！快看这场滇川摩梭人的猪槽船比赛",
    imgurl: "../../assets/news/new9.jpg",
    time: "2017-05-30 15:02",
    content: {
      title: "赛龙舟有什么稀奇！快看这场滇川摩梭人的猪槽船比赛",
      subtitle: "丽江读本 05-30 15:02",
      news: [{
        types: "text",
        id: "1",
        content: "“加油！加油！使劲划！”今天，在端午佳节之际，摩梭人民在泸沽湖畔大落水码头举办了主题为“五彩泸沽湖，欢乐端午节”的2017年端午节摩梭猪槽船划船比赛，现场热闹非凡。"
      }, {
        types: "img",
        id: "2",
        imgurl: "../../assets/news/new9_1.jpg",
        content: "图1"
      }, {
        types: "text",
        id: "3",
        content: "据悉，此次端午节摩梭猪槽船比赛，是由丽江泸沽湖省级旅游区管理委员会主办，宁蒗县永宁乡政府、落水村委会以及驻泸沽湖景区相关部门协办，永宁乡落水村委会落水村民小组具体承办。"
      }, {
        types: "img",
        id: "4",
        imgurl: "../../assets/news/new9_2.jpg",
        content: "图2"
      }, {
        types: "text",
        id: "5",
        content: "猪槽船在泸沽湖畔随处可见，是摩梭人重要的交通工具。它如叶子般荡漾在湖面上，很美。而猪槽船比赛，是摩梭人的传统。"
      }, {
        types: "img",
        id: "6",
        imgurl: "../../assets/news/new9_3.jpg",
        content: "图3"
      }, {
        types: "img",
        id: "7",
        imgurl: "../../assets/news/new9_4.jpg",
        content: "李扬/摄"
      }, {
        types: "text",
        id: "8",
        content: "比赛开始前，先是进行了达巴祈福仪式。前来参加祈福的人，纷纷脱下帽子，双手合十，虔诚祈福。"
      }, {
        types: "img",
        id: "9",
        imgurl: "../../assets/news/new9_5.jpg",
        content: "图5"
      }]
    }
  }, {
    types: "new",
    id: 10,
    title: "厉害了！云南这些旅游项目将获8400亿融资，丽江就有3个上榜",
    imgurl: "../../assets/news/new10.jpg",
    time: "2017-06-04 14:27",
    content: {
      title: "厉害了！云南这些旅游项目将获8400亿融资，丽江就有3个上榜",
      subtitle: "丽江读本 05-25 08:45",
      news: [{
        types: "text",
        id: "1",
        content: "近日，2017年全国旅游投融资促进大会上，国家旅游局会同国家开发银行等12家金融机构共同遴选推出了680个优选旅游项目，计划投资总额1.6万亿元。其中，云南共有26个项目入选。"
      }, {
        types: "text",
        id: "2",
        content: "而这26个项目里面，丽江占据3席，分别是：金沙江大峡谷（丽江段）航运旅游项目、丽江束河古镇东部主入口交通综合政治项目、丽江复华度假世界。"
      }, {
        types: "text",
        id: "3",
        content: "金沙江大峡谷（丽江段）航运旅游项目，关于金沙江大峡谷（丽江段）航运旅游项目，读本君之前已经做过多次报道。清代，一官员路过白鹤驿时慨叹蜀道艰险，亦作诗一首：自古金沙不通舟，水急天高一望愁。何日天人开一线，联檣衔尾往来遊。如今金沙江航运搞起来，“不通舟”的情况将不复存在。"
      }, {
        types: "img",
        id: "4",
        imgurl: "../../assets/news/new10_1.jpg",
        content: "图1"
      }, {
        types: "text",
        id: "5",
        content: "2016年12月27日，下午3点40分，玉龙县奉科镇革囊渡码头，随着4艘崭新的游船下水试航，彻底打破金沙江中游不通航运的历史，金沙江航运旅游自此掀开了崭新的一页。"
      }, {
        types: "text",
        id: "6",
        content: "金沙江大峡谷（丽江段）航运旅游景区项目包含金沙江梨园、阿海、金安桥、龙开口、鲁地拉、观音岩等6个库区，建设24座码头（24个320客位客运泊位、24个500吨货运泊位、6个应急救援专用泊位）。"
      }, {
        types: "img",
        id: "7",
        imgurl: "../../assets/news/new10_2.jpg",
        content: "图2"
      }, {
        types: "text",
        id: "8",
        content: "航运旅游是一种新型旅游方式，对当地的餐饮、交通、公共服务及其他相关行业等具有明显的带动作用以及综合经济效应。据悉，金沙江丽江段建设的码头有树底码头、阿海上翻坝码头、阿海下翻坝码头、宝山码头（对，没错，就在石头城下面）、奉科码头、棋盘地码头、大具码头等。"
      }, {
        types: "text",
        id: "9",
        content: "丽江束河古镇东部主入口交通综合政治项目此前，丽江读本微信公众平台曾发布报道《丽江束河古镇在建一个有千余停车位的停车场，两年内建成》，其中提到，为缓解多年来束河古镇的停车难、停车乱的问题，束河古镇东部入口处正在建一个拥有1300多个停车位的停车场。"
      }, {
        types: "img",
        id: "10",
        imgurl: "../../assets/news/new10_3.jpg",
        content: "停车场建好后束河古镇全景效果图"
      }, {
        types: "text",
        id: "11",
        content: "据介绍，按照规划，建好后不仅是旅游大巴、小轿车可以停放，也为三八路、出租车等运营车设置了停车位。以后在束河坐车会方便很多。"
      }, {
        types: "text",
        id: "12",
        content: "今日，读本君联系到了该项目负责人陈海生先生，其告诉读本君，“该项目正在推进中，目前已投资近1亿。”"
      }, {
        types: "text",
        id: "13",
        content: "据了解，该项目预计在明年建成投入使用，“整个停车场一共四层，地下两层都是停车位，建好后可容纳1200个小轿车同时停放；地面上两层，可容纳60个大巴车停放，同时还规划了出租车、三八路面包车、马车的停车位，预计在100个左右。这样一来出入束河古镇的五类车辆全部有了专门的停车位。”陈海生说。"
      }, {
        types: "text",
        id: "14",
        content: "丽江复华度假世界，2015年5月6日，复华置地与钓鱼台美高梅酒店集团成功举办了战略合作签约仪式，双方将在丽江束河古镇核心区打造“丽江复华度假世界”，斥资60亿。"
      }, {
        types: "img",
        id: "15",
        imgurl: "../../assets/news/new10_4.jpg",
        content: "图4"
      }]
    }
  }];
}

function getNewById(id) {
  var news = getNews();
  var content = null;
  news.forEach(function (newitem) {
    if (newitem.id == id) {
      content = newitem.content;
    }
  });
  return content;
}

///////////////////////地图部分
//动态添加数据
function addMapData(source, mapitem) {
  //判断当前元素是否在数据中存在
  var con = true;
  for (var i = 0; i < source.length; i++) {
    var map = source[i];
    if (map.id == mapitem.id) {
      con = false;
      break;
    }
  }
  if (con) { //添加
    source.push(mapitem);
  }
}

//根据标记类型获取地图数据
function getMapDataByType(source, typename) {
  var datas = [];
  for (var i = 0; i < source.length; i++) {
    var map = source[i];
    if (map.typename == typename) {
      datas.push(map);
    }
  }
  return datas;
}

//根据关键词获取地图数据
function getMapDataByName(source, text) {
  var datas = [];
  for (var i = 0; i < source.length; i++) {
    var map = source[i];
    if (map.title.indexOf(text) != -1) {
      datas.push(map);
    }
  }
  return datas;
}
//根据id获取地图数据
function getMapDataById(source, id) {
  var data = undefined;
  for (var i = 0; i < source.length; i++) {
    var map = source[i];
    if (map.id == id) {
      data = map;
      break;
    }
  }
  return data;
}
///////////////////////获取设备信息
function getSystem() {
  var system = {};
  try {
    var res = wx.getSystemInfoSync();
    system.model = res.model;  //手机型号
    system.pixelRatio = res.pixelRatio;  //设备像素比
    system.windowWidth = res.windowWidth; //可使用窗口宽度
    system.windowHeight = res.windowHeight; //可使用窗口高度
    system.language = res.language; //微信设置的语言
    system.version = res.version; //微信版本号
    system.system = res.system; //操作系统版本
    system.platform = res.platform; //客户端平台
    system.scale = 750 / system.windowWidth;  //rpx比例
  } catch (e) {
    // Do something when catch error
  }
  return system;
}

module.exports = {
  getSystem: getSystem,
  getLines: getLines,
  getLineById: getLineById,
  getNews: getNews,
  getNewById: getNewById,
  addMapData: addMapData,
  getMapDataByName: getMapDataByName,
  getMapDataById: getMapDataById,
  getMapDataByType: getMapDataByType
}